{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_conv0_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pooling0_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pooling0_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize", 
      "name": "pooling0_quantize", 
      "attrs": {"out_type": "uint8"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.029983", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [7, 1, 0], [7, 2, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "4.756754", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [14, 1, 0], [14, 2, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1sc_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1sc_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1sc_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv1sc_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1sc_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1sc_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv1sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.512188", 
        "min_calib_range": "-9.200014", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "int8", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[7, 0, 0], [24, 0, 0], [25, 0, 0], [7, 1, 0], [7, 2, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit1_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.901609", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [21, 0, 0], 
        [22, 0, 0], 
        [23, 0, 0], 
        [30, 0, 0], 
        [21, 1, 0], 
        [21, 2, 0], 
        [31, 0, 0], 
        [32, 0, 0], 
        [33, 0, 0], 
        [34, 0, 0], 
        [30, 1, 0], 
        [30, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "5.739786", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [35, 1, 0], [35, 2, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "3.952859", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [42, 1, 0], [42, 2, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit2_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "7.340293", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [49, 0, 0], 
        [50, 0, 0], 
        [51, 0, 0], 
        [35, 0, 0], 
        [49, 1, 0], 
        [49, 2, 0], 
        [52, 0, 0], 
        [53, 0, 0], 
        [54, 0, 0], 
        [55, 0, 0], 
        [35, 1, 0], 
        [35, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "5.623948", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [56, 1, 0], [56, 2, 0], [59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "3.686995", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "64", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [63, 1, 0], [63, 2, 0], [66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage1_unit3_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage1_unit3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "6.821745", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [70, 0, 0], 
        [71, 0, 0], 
        [72, 0, 0], 
        [56, 0, 0], 
        [70, 1, 0], 
        [70, 2, 0], 
        [73, 0, 0], 
        [74, 0, 0], 
        [75, 0, 0], 
        [76, 0, 0], 
        [56, 1, 0], 
        [56, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "2.905856", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [77, 1, 0], [77, 2, 0], [80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "3.122983", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [84, 1, 0], [84, 2, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1sc_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1sc_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1sc_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv1sc_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1sc_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1sc_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv1sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.689108", 
        "min_calib_range": "-3.862752", 
        "no_bias": "False", 
        "num_filter": "512", 
        "out_type": "int8", 
        "stride": "(2, 2)", 
        "with_convsumrelu_in": "True", 
        "workspace": "256"
      }, 
      "inputs": [[77, 0, 0], [94, 0, 0], [95, 0, 0], [77, 1, 0], [77, 2, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit1_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.949511", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "512", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [91, 0, 0], 
        [92, 0, 0], 
        [93, 0, 0], 
        [100, 0, 0], 
        [91, 1, 0], 
        [91, 2, 0], 
        [101, 0, 0], 
        [102, 0, 0], 
        [103, 0, 0], 
        [104, 0, 0], 
        [100, 1, 0], 
        [100, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.023131", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [105, 1, 0], [105, 2, 0], [108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "5.105916", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [112, 1, 0], [112, 2, 0], [115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit2_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.598146", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "512", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [119, 0, 0], 
        [120, 0, 0], 
        [121, 0, 0], 
        [105, 0, 0], 
        [119, 1, 0], 
        [119, 2, 0], 
        [122, 0, 0], 
        [123, 0, 0], 
        [124, 0, 0], 
        [125, 0, 0], 
        [105, 1, 0], 
        [105, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit3_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.782458", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [126, 1, 0], [126, 2, 0], [129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "6.905182", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [133, 1, 0], [133, 2, 0], [136, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit3_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "5.018733", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "512", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [140, 0, 0], 
        [141, 0, 0], 
        [142, 0, 0], 
        [126, 0, 0], 
        [140, 1, 0], 
        [140, 2, 0], 
        [143, 0, 0], 
        [144, 0, 0], 
        [145, 0, 0], 
        [146, 0, 0], 
        [126, 1, 0], 
        [126, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit4_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.991051", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0], [147, 1, 0], [147, 2, 0], [150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit4_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "7.453251", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "128", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [154, 1, 0], [154, 2, 0], [157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage2_unit4_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage2_unit4_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "5.229827", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "512", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [161, 0, 0], 
        [162, 0, 0], 
        [163, 0, 0], 
        [147, 0, 0], 
        [161, 1, 0], 
        [161, 2, 0], 
        [164, 0, 0], 
        [165, 0, 0], 
        [166, 0, 0], 
        [167, 0, 0], 
        [147, 1, 0], 
        [147, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "1.996117", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0], [168, 1, 0], [168, 2, 0], [171, 0, 0], [172, 0, 0], [173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "2.592604", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [175, 1, 0], [175, 2, 0], [178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1sc_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1sc_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1sc_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv1sc_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1sc_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1sc_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit1_conv1sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.829422", 
        "min_calib_range": "-2.371148", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "out_type": "int8", 
        "stride": "(2, 2)", 
        "with_convsumrelu_in": "True", 
        "workspace": "256"
      }, 
      "inputs": [[168, 0, 0], [185, 0, 0], [186, 0, 0], [168, 1, 0], [168, 2, 0], [187, 0, 0], [188, 0, 0], [189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit1_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.300969", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [182, 0, 0], 
        [183, 0, 0], 
        [184, 0, 0], 
        [191, 0, 0], 
        [182, 1, 0], 
        [182, 2, 0], 
        [192, 0, 0], 
        [193, 0, 0], 
        [194, 0, 0], 
        [195, 0, 0], 
        [191, 1, 0], 
        [191, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit2_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "1.973175", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0], [196, 1, 0], [196, 2, 0], [199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "1.952935", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[203, 0, 0], [204, 0, 0], [205, 0, 0], [203, 1, 0], [203, 2, 0], [206, 0, 0], [207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit2_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.800905", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [210, 0, 0], 
        [211, 0, 0], 
        [212, 0, 0], 
        [196, 0, 0], 
        [210, 1, 0], 
        [210, 2, 0], 
        [213, 0, 0], 
        [214, 0, 0], 
        [215, 0, 0], 
        [216, 0, 0], 
        [196, 1, 0], 
        [196, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit3_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "2.371483", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0], [217, 1, 0], [217, 2, 0], [220, 0, 0], [221, 0, 0], [222, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "3.849189", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[224, 0, 0], [225, 0, 0], [226, 0, 0], [224, 1, 0], [224, 2, 0], [227, 0, 0], [228, 0, 0], [229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit3_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.894954", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [231, 0, 0], 
        [232, 0, 0], 
        [233, 0, 0], 
        [217, 0, 0], 
        [231, 1, 0], 
        [231, 2, 0], 
        [234, 0, 0], 
        [235, 0, 0], 
        [236, 0, 0], 
        [237, 0, 0], 
        [217, 1, 0], 
        [217, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit4_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "3.607307", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[238, 0, 0], [239, 0, 0], [240, 0, 0], [238, 1, 0], [238, 2, 0], [241, 0, 0], [242, 0, 0], [243, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit4_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "max_calib_range": "2.892550", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "256", 
        "out_type": "uint8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "with_relu": "True", 
        "workspace": "256"
      }, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0], [245, 1, 0], [245, 2, 0], [248, 0, 0], [249, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit4_conv3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_conv", 
      "name": "quantized_stage3_unit4_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "max_calib_range": "4.207720", 
        "min_calib_range": "-0.000000", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "out_type": "uint8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "with_convsumrelu_in": "True", 
        "with_postsum_relu": "True", 
        "with_sum": "True", 
        "workspace": "256"
      }, 
      "inputs": [
        [252, 0, 0], 
        [253, 0, 0], 
        [254, 0, 0], 
        [238, 0, 0], 
        [252, 1, 0], 
        [252, 2, 0], 
        [255, 0, 0], 
        [256, 0, 0], 
        [257, 0, 0], 
        [258, 0, 0], 
        [238, 1, 0], 
        [238, 2, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "convBNReluPara_stage3_unit5_conv1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_conv1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
